{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.21.0", "signature": {"inputs": {"normalization_10_input": {"name": "normalization_10_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "7"}]}}}, "outputs": {"dense_87": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_10/dense_86/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_86/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_85/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_85/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_84/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_84/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_83/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_83/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_82/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_82/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_81/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_81/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_80/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_80/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "7"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_10/normalization_10/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "7"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_80/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "70"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_80/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "70"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_10/dense_80/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_81/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "70"}, {"size": "70"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_81/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "70"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_10/dense_81/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_82/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "70"}, {"size": "70"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_82/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "70"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_10/dense_82/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_83/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "70"}, {"size": "70"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_83/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "70"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_10/dense_83/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_84/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "70"}, {"size": "70"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_84/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "70"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_10/dense_84/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_85/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "70"}, {"size": "70"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_85/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "70"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_10/dense_85/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_86/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "70"}, {"size": "70"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_86/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "70"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_10/dense_86/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_87/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "70"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_87/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "normalization_10_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "7"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/normalization_10/sub", "op": "Sub", "input": ["normalization_10_input", "unknown"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/normalization_10/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_10/normalization_10/sub", "ConstantFolding/StatefulPartitionedCall/sequential_10/normalization_10/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_80/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_10/normalization_10/truediv", "StatefulPartitionedCall/sequential_10/dense_80/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_10/dense_80/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_80/Gelu/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_10/dense_80/Gelu/mul/x", "StatefulPartitionedCall/sequential_10/dense_80/BiasAdd"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_80/Gelu/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_10/dense_80/BiasAdd", "ConstantFolding/StatefulPartitionedCall/sequential_10/dense_80/Gelu/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_80/Gelu/Erf", "op": "Erf", "input": ["StatefulPartitionedCall/sequential_10/dense_80/Gelu/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_80/Gelu/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_10/dense_80/Gelu/add/x", "StatefulPartitionedCall/sequential_10/dense_80/Gelu/Erf"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_80/Gelu/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_10/dense_80/Gelu/mul", "StatefulPartitionedCall/sequential_10/dense_80/Gelu/add"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_81/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_10/dense_80/Gelu/mul_1", "StatefulPartitionedCall/sequential_10/dense_81/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_10/dense_81/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_81/Gelu/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_10/dense_81/Gelu/mul/x", "StatefulPartitionedCall/sequential_10/dense_81/BiasAdd"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_81/Gelu/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_10/dense_81/BiasAdd", "ConstantFolding/StatefulPartitionedCall/sequential_10/dense_81/Gelu/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_81/Gelu/Erf", "op": "Erf", "input": ["StatefulPartitionedCall/sequential_10/dense_81/Gelu/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_81/Gelu/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_10/dense_81/Gelu/add/x", "StatefulPartitionedCall/sequential_10/dense_81/Gelu/Erf"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_81/Gelu/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_10/dense_81/Gelu/mul", "StatefulPartitionedCall/sequential_10/dense_81/Gelu/add"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_82/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_10/dense_81/Gelu/mul_1", "StatefulPartitionedCall/sequential_10/dense_82/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_10/dense_82/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_82/Gelu/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_10/dense_82/Gelu/mul/x", "StatefulPartitionedCall/sequential_10/dense_82/BiasAdd"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_82/Gelu/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_10/dense_82/BiasAdd", "ConstantFolding/StatefulPartitionedCall/sequential_10/dense_82/Gelu/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_82/Gelu/Erf", "op": "Erf", "input": ["StatefulPartitionedCall/sequential_10/dense_82/Gelu/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_82/Gelu/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_10/dense_82/Gelu/add/x", "StatefulPartitionedCall/sequential_10/dense_82/Gelu/Erf"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_82/Gelu/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_10/dense_82/Gelu/mul", "StatefulPartitionedCall/sequential_10/dense_82/Gelu/add"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_83/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_10/dense_82/Gelu/mul_1", "StatefulPartitionedCall/sequential_10/dense_83/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_10/dense_83/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_83/Gelu/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_10/dense_83/Gelu/mul/x", "StatefulPartitionedCall/sequential_10/dense_83/BiasAdd"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_83/Gelu/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_10/dense_83/BiasAdd", "ConstantFolding/StatefulPartitionedCall/sequential_10/dense_83/Gelu/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_83/Gelu/Erf", "op": "Erf", "input": ["StatefulPartitionedCall/sequential_10/dense_83/Gelu/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_83/Gelu/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_10/dense_83/Gelu/add/x", "StatefulPartitionedCall/sequential_10/dense_83/Gelu/Erf"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_83/Gelu/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_10/dense_83/Gelu/mul", "StatefulPartitionedCall/sequential_10/dense_83/Gelu/add"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_84/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_10/dense_83/Gelu/mul_1", "StatefulPartitionedCall/sequential_10/dense_84/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_10/dense_84/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_84/Gelu/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_10/dense_84/Gelu/mul/x", "StatefulPartitionedCall/sequential_10/dense_84/BiasAdd"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_84/Gelu/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_10/dense_84/BiasAdd", "ConstantFolding/StatefulPartitionedCall/sequential_10/dense_84/Gelu/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_84/Gelu/Erf", "op": "Erf", "input": ["StatefulPartitionedCall/sequential_10/dense_84/Gelu/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_84/Gelu/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_10/dense_84/Gelu/add/x", "StatefulPartitionedCall/sequential_10/dense_84/Gelu/Erf"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_84/Gelu/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_10/dense_84/Gelu/mul", "StatefulPartitionedCall/sequential_10/dense_84/Gelu/add"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_85/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_10/dense_84/Gelu/mul_1", "StatefulPartitionedCall/sequential_10/dense_85/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_10/dense_85/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_85/Gelu/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_10/dense_85/Gelu/mul/x", "StatefulPartitionedCall/sequential_10/dense_85/BiasAdd"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_85/Gelu/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_10/dense_85/BiasAdd", "ConstantFolding/StatefulPartitionedCall/sequential_10/dense_85/Gelu/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_85/Gelu/Erf", "op": "Erf", "input": ["StatefulPartitionedCall/sequential_10/dense_85/Gelu/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_85/Gelu/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_10/dense_85/Gelu/add/x", "StatefulPartitionedCall/sequential_10/dense_85/Gelu/Erf"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_85/Gelu/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_10/dense_85/Gelu/mul", "StatefulPartitionedCall/sequential_10/dense_85/Gelu/add"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_86/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_10/dense_85/Gelu/mul_1", "StatefulPartitionedCall/sequential_10/dense_86/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_10/dense_86/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_86/Gelu/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_10/dense_86/Gelu/mul/x", "StatefulPartitionedCall/sequential_10/dense_86/BiasAdd"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_86/Gelu/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_10/dense_86/BiasAdd", "ConstantFolding/StatefulPartitionedCall/sequential_10/dense_86/Gelu/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_86/Gelu/Erf", "op": "Erf", "input": ["StatefulPartitionedCall/sequential_10/dense_86/Gelu/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_86/Gelu/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_10/dense_86/Gelu/add/x", "StatefulPartitionedCall/sequential_10/dense_86/Gelu/Erf"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_86/Gelu/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_10/dense_86/Gelu/mul", "StatefulPartitionedCall/sequential_10/dense_86/Gelu/add"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_87/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_10/dense_86/Gelu/mul_1", "StatefulPartitionedCall/sequential_10/dense_87/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_10/dense_87/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_10/dense_87/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1645}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_10/dense_86/Gelu/mul/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/dense_86/Gelu/add/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/dense_85/Gelu/mul/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/dense_85/Gelu/add/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/dense_84/Gelu/mul/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/dense_84/Gelu/add/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/dense_83/Gelu/mul/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/dense_83/Gelu/add/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/dense_82/Gelu/mul/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/dense_82/Gelu/add/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/dense_81/Gelu/mul/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/dense_81/Gelu/add/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/dense_80/Gelu/mul/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/dense_80/Gelu/add/x", "shape": [], "dtype": "float32"}, {"name": "unknown", "shape": [1, 7], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_10/normalization_10/truediv_recip", "shape": [1, 7], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/dense_80/MatMul/ReadVariableOp", "shape": [7, 70], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/dense_80/BiasAdd/ReadVariableOp", "shape": [70], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_10/dense_80/Gelu/truediv_recip", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/dense_81/MatMul/ReadVariableOp", "shape": [70, 70], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/dense_81/BiasAdd/ReadVariableOp", "shape": [70], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_10/dense_81/Gelu/truediv_recip", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/dense_82/MatMul/ReadVariableOp", "shape": [70, 70], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/dense_82/BiasAdd/ReadVariableOp", "shape": [70], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_10/dense_82/Gelu/truediv_recip", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/dense_83/MatMul/ReadVariableOp", "shape": [70, 70], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/dense_83/BiasAdd/ReadVariableOp", "shape": [70], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_10/dense_83/Gelu/truediv_recip", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/dense_84/MatMul/ReadVariableOp", "shape": [70, 70], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/dense_84/BiasAdd/ReadVariableOp", "shape": [70], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_10/dense_84/Gelu/truediv_recip", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/dense_85/MatMul/ReadVariableOp", "shape": [70, 70], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/dense_85/BiasAdd/ReadVariableOp", "shape": [70], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_10/dense_85/Gelu/truediv_recip", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/dense_86/MatMul/ReadVariableOp", "shape": [70, 70], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/dense_86/BiasAdd/ReadVariableOp", "shape": [70], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_10/dense_86/Gelu/truediv_recip", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/dense_87/MatMul/ReadVariableOp", "shape": [70, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/dense_87/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}